Repository: Khalid-J02/Software_Project
Catalog: lib/l10n/app_*.arb
Languages: ar

# task2_InformationTitle
source: Required Documents for This Task
ar: المستندات المطلوبة لهذه المهمة

# task2_InformationTitle2
source: Required Drawings for This Task
ar: المخططات المطلوبة لهذه المهمة

# sp_task3Name
source: Soil Investigation
ar: فحص التربة

# sp_task3Document
source: Soil Invest Document:
ar: مستند فحص التربة:

# sp_task4Name
source: Design and Planning
ar: التصميم والتخطيط

# sp_task3Document_task4
source: Soil Document:
ar: مستند فحص التربة:

# sp_task4Demands
source: Homeowner Demands
ar: طلبات مالك المنزل

# sp_task4DemandsRooms
source: Num. of Rooms:
ar: عدد الغرف:

# sp_task4DemandsFloors
source: Num. of Floors:
ar: عدد الطوابق:

# sp_task4DemandsArea
source: House Building Area:
ar: مساحة بناء المنزل:

# sp_task4Chosen
source: Not Chosen
ar: غير مختار

# sp_task4Design
source: Design Drawings:
ar: المخطط الكلي:

# sp_task4Arch
source: Architectural Drawings:
ar: مخطط معماري:

# sp_task4Civil
source: Civil Drawings:
ar: مخطط مدني:

# sp_task4Mech
source: Mechanical Drawings:
ar: مخطط ميكانيك:

# sp_task4Elect
source: Electrical Drawings:
ar: مخطط كهرباء:

# sp_task5Name
source: Obtaining Approvals
ar: الحصول على الموافقات

# sp_task5Design
source: Design Drawings:
ar: المخطط الكلي:

# sp_task5App
source: Approvals Document:
ar: مستند الموافقات:

# sp_task6Name
source: Foundation & Construction
ar: بناء الأساسات

# sp_task6Civil
source: Civil Drawings:
ar: مخطط المدني:

# sp_task6Arch
source: Architectural Drawings:
ar: مخطط المعماري:

# sp_task6Provider
source: Construction Material Provider:
ar: مزود مواد البناء:

# sp_task6ServiceChosen
source: Service Provider-Me
ar: مقدم الخدمة - أنا

# sp_task6HomeChosen
source: Homeowner
ar: صاحب البيت

# sp_task7Name
source: Mechanical Work
ar: الأعمال الميكانيكية

# sp_task7_Mech
source: Mechanical Drawings:
ar: مخطط الميكانيك:

# sp_task8Name
source: Electrical Work
ar: الأعمال الكهربائية

# sp_task8Elect
source: Electrical Drawings:
ar: مخطط الكهرباء:

# sp_task9Name
source: Insulation Work
ar: أعمال العزل

# sp_task10Name
source: Door Frame Installation
ar: تركيب إطارات الأبواب

# sp_task11Name
source: Plastering Work
ar: قصارة البيت -التجصيص-

# sp_task10homeownerNeeds
source: Homeowner Needs
ar: طلبات مالك المنزل

# sp_task10BedroomDoor
source: Bedroom Door:
ar: باب غرف النوم:

# sp_task10BathroomDoor
source: Bathroom Door:
ar: باب الحمام:

# sp_task10LivingDoor
source: Living Room Door:
ar: باب غرفة المعيشة:

# sp_task10GuestDoor
source: Guest Room Door:
ar: باب غرفة الضيوف:

# sp_task10Details
source: See Details
ar: عرض التفاصيل

# sp_task10snackbarTitle
source: Alert Message
ar: رسالة تنبيه

# sp_task10snackbarContent
source: Homeowner does not choose an item yet
ar: لم يختر صاحب المنزل أي عنصر بعد

# sp_task10ItemDialog
source: Homeowner Choice
ar: اختيار صاحب المنزل

# sp_task10ItemDialogClose
source: Done
ar: إغلاق

# sp_task12Name
source: Tile Work
ar: أعمال البلاط

# sp_task12BathroomTile
source: Bathroom Tile:
ar: بلاط الحمام:

# sp_task12HouseTile
source: House Tile:
ar: بلاط المنزل:

# sp_task15Title
source: Painting Work
ar: طلاء البيت

# sp_task15BedroomPaint
source: Bedroom Paint:
ar: دهان غرف النوم:

# sp_task15BathroomPaint
source: Bathroom Paint:
ar: دهان الحمام:

# sp_task15LivingPaint
source: Living Room Paint:
ar: دهان غرفة المعيشة:

# sp_task15GuestPaint
source: Guest Room Paint:
ar: دهان غرفة الضيوف:

# sp_task15KitchenPaint
source: Kitchen Paint:
ar: دهان المطبخ:

# sp_task13Name
source: Aluminum Work
ar: أعمال الألمنيوم

# sp_task13Design
source: Window Design:
ar: نوع النوافذ:

# sp_task14Name
source: Carpentry Work
ar: أعمال النجارة

# sp_task14Design
source: Door Design:
ar: نوع الأبواب:

# snackbarDownloadContent
source: File Downloaded
ar: تم تنزيل الملف

# task1HOMainTitle
source: Task Details
ar: تفاصيل المهمة

# task1HOTaskName
source: Property Survey
ar: مسح الممتلكات

# task1HOServiceProviderDetailsTitle
source: Service Provider Details
ar: معلومات من مُقدم الخدمة

# task1HOLandArea
source: Land Area:
ar: مساحة الأرض:

# task1HOSurveyDocument
source: Survey Document:
ar: ملف مُخطط المساحة:

# task1HOServiceProviderNotes
source: Service Provider Notes:
ar: ملاحظات مُقدم الخدمة:

# task1HONoNotesSP
source: No notes available
ar: لا يوجد ملاحظات بعد

# task2HOTaskName
source: Regulatory Information
ar: الحصول على التصاريح والمعلومات التنظيمية

# task2HOPermitsDocument
source: Permits Document:
ar: وثيقة التصاريح:

# task3HOTaskName
source: Soil Investigation
ar: فحص التربة

# task3HOSoilDocument
source: Soil Invest Document:
ar: وثيقة فحص التربة:

# task4HOTaskName
source: Design and Planning
ar: التصميم والتخطيط

# task4HODesignDocument
source: Design Drawings:
ar: مخطط التصميم

# task4HODemandsMainTitle
source: Home Owner Demands
ar: مطالب مالك المنزل - المشروع

# task4HODemandsNumRoom
source: Enter Num. of Rooms:
ar: أدخل عدد الغرف :

# task4HODemandsNumRoomHintText
source: Enter # of Rooms
ar: أدخل عدد الغرف هنا ..

# task4HODemandsNumRoomLabelText
source: Rooms Number
ar: عدد الغرف

# task4HODemandsNumFloor
source: Enter Num. of Floors:
ar: أدخل عدد الطوابق :

# task4HODemandsNumFloorHintText
source: Enter # of Floors
ar: أدخل عدد الطوابق هنا ..

# task4HODemandsNumFloorLabelText
source: Floors Number
ar: عدد الطوابق

# task4HODemandsBuildingArea
source: House Building Area:
ar: مساحة بناء المنزل - المشروع :

# task4HODemandsBuildingAreaHintText
source: Enter desired Building Area
ar: أدخل مساحة المنزل هنا ..

# task4HODemandsBuildingAreaLabelText
source: Building Area
ar: مساحة المنزل

# task4HODemandsSaveButton
source: Save
ar: حفظ

# task4HOArchitecturalDrawings
source: Architectural Drawings:
ar: مخطط العمارة:

# task4HOCivilDrawings
source: Civil Drawings:
ar: المخطط المدني

# task4HOMechanicalDrawings
source: Mechanical Drawings:
ar: مخطط إمدادات المياه

# task4HOElectricalDrawings
source: Electrical Drawings:
ar: مخطط إمدادات الكهرباء

# task5HOTaskName
source: Obtaining Approvals
ar: الحصول على الموافقات

# task5HOApprovalDocument
source: Approval Documents:
ar: وثائق الموافقات:

# task6HOTaskName
source: Foundation and Framing Construction
ar: بناء الأساسات

# task6HOChoices
source: Home Owner Choice
ar: اختيارات مالك المنزل

# task6HOMaterialProvider
source: Construction Material provider:
ar: مزود مواد البناء:

# task6HOMaterialProviderHO
source: Me -HomeOwner-
ar: أنا - مالك المنزل -

# task6HOMaterialProviderSP
source: Service Provider
ar: مُقدم الخدمة

# task6HOSaveLabelButton
source: Save
ar: حفظ

# task7HOTaskName
source: Mechanical Work
ar: إمدادات خطوط المياه

# task8HOTaskName
source: Electrical Work
ar: إمدادات خط الكهرباء

# task9HOTaskName
source: Insulation Work
ar: أعمال العزل و التدفئة

# task11HOTaskName
source: Door Frame Installation
ar: تركيب إطارات الأبواب

# task11HONeeds
source: Home Owner Needs
ar: متطلبات مالك المنزل

# task11HONeedsSubTitle
source: Choose Door Design For The Following:
ar: اختر تصميم الباب لما يلي:

# task11HONeedsBedroom
source: Bedroom:
ar: غرف النوم:

# task11HONeedsSeeItem
source: See Item
ar: عرض العنصر

# task11HONeedsOpenCatalog
source: Open Catalog
ar: فتح الكتالوج

# task11HONeedsBathroom
source: Bathroom:
ar: الحمام:

# task11HONeedsLivingRoom
source: Living Room:
ar: غرفة المعيشة:

# task11HONeedsGuestRoom
source: Guest Room:
ar: غرفة الضيوف:

# task11HONeedsSaveLabelButton
source: Save
ar: حفظ

# task10HOTaskName
source: Plastering Work
ar: قصارة البيت - التجصيص -

# task12HOTaskName
source: Tile Work
ar: وضع البلاط

# task12HONeedsSubTitle
source: Choose Tile Type For The Following:
ar: اختر نوع البلاط لما يلي:

# task12HONeedsBathroom
source: Bathroom:
ar: الحمام:

# task12HONeedsSeeItem
source: See Item
ar: عرض العنصر

# task12HONeedsOpenCatalog
source: Open Catalog
ar: فتح الكتالوج

# task12HONeedsHouse
source: House:
ar: المنزل:

# task14HOTaskName
source: Aluminum Work
ar: أعمال الألمنيوم

# task14HONeedsSubTitle
source: Choose Window Design you need:
ar: اختر تصميم النافذة التي تحتاجها:

# task14HONeedsDesign
source: Window Design:
ar: تصميم النوافذ:

# task14HONeedsSeeItem
source: See Item
ar: عرض العنصر

# task14HONeedsOpenCatalog
source: Open Catalog
ar: فتح الكتالوج

# task15HOTaskName
source: Carpentry Work
ar: أعمال النجارة

# task15HONeedsSubTitle
source: Choose Door Design For The Following:
ar: اختر تصميم الباب لما يلي:

# task15HONeedsDoorDesign
source: Door Design:
ar: تصميم الباب:

# task15HONeedsSeeItem
source: See Item
ar: عرض العنصر

# task15HONeedsOpenCatalog
source: Open Catalog
ar: فتح الكتالوج

# task13HOTaskName
source: Painting Work
ar: طلاء البيت

# task13HONeedsSubTitle
source: Choose Paint Color For The Following:
ar: اختر لون الطلاء لما يلي:

# task13HONeedsBedroom
source: Bedroom:
ar: غرف النوم:

# task13HONeedsSeeItem
source: See Item
ar: عرض العنصر

# task13HONeedsOpenCatalog
source: Open Catalog
ar: فتح الكتالوج

# task13HONeedsBathroom
source: Bathroom:
ar: الحمام:

# task13HONeedsLivingRoom
source: Living Room:
ar: غرفة المعيشة:

# task13HONeedsGuestRoom
source: Guest Room:
ar: غرفة الضيوف:

# task13HONeedsKitchen
source: Kitchen:
ar: المطبخ:

# taskInformationTaskNumber
source: Task #
ar: مهمة #

# taskInformationTask
source: Task
ar: المهمة

# taskInformationProjectLabel
source: Construction
ar: المشروع

# taskInformationStatusLabel
source: Status
ar: الحالة

# landInformationMainTitle
source: Land Information
ar: معلومات عن الأرض

# landInformationBasinNumber
source: BasinNumber
ar: رقم الحوض

# landInformationPlotNumber
source: PlotNumber
ar: رقم القطعة

# serviceProviderProfileDataMainTitle
source: Task Provider
ar: مُقدم الخدمة

# serviceProviderProfileDataReviewButton
source: Review
ar: تقييم

# serviceProviderProfileDataReviewsNumber
source: reviews)
ar: تقييمات)

# helloMSG
source: Hi
ar: مرحباً

# errorDownloadMsg
source: There is no file to download
ar: لا يوجد ملف يمكنك تنزيله بعد

# errorOpenMsg
source: There is no file to open
ar: لا يوجد ملف يمكنك فتحه بعد

# downloadLabelButton
source: Download
ar: تنزيل الملف

# openLabelButton
source: Open
ar: فتح

# searchPageHOMainTitle
source: Search
ar: بحث

# searchPageHOWelcomeMsg
source: Welcome Back !
ar: مرحبا بك مجدداً !

# searchPageHOSearchBarLabel
source: Search for Service Providers
ar: بحث عن مقدمي خدمات

# searchPageHOSearchServices
source: Services
ar: الخدمات

# searchPageHODiscover
source: Discover
ar: استكشف

# sPProfilePageHOCompletedTasks
source: Completed Tasks
ar: المهام المنجزة

# sPProfilePageHORequestAssign
source: Request Assign
ar: طلب تعيين مهمة

# sPProfilePageHOReviews
source: Reviews
ar: التقييمات

# sPProfilePageHOBarCatalog
source: Catalog
ar: كتالوج

# sPProfilePageHOBarWork
source: Work Exp.
ar: أعمال سابقة

# sPProfilePageHOBarReviews
source: Reviews
ar: تقييمات

# sPProfilePageHOBarNoItemsFound
source: There is no items to see here...
ar: لا توجد عناصر يمكن رؤيتها هنا...

# sPProfilePageHOBarNoReviewsFound
source: There is no reviews yet...
ar: لا توجد تقييمات بعد...

# homeOwnerProfilePhone
source: Phone Number
ar: رقم الهاتف

# homeOwnerProfileEMail
source: E-Mail
ar: البريد الإلكتروني

# homeOwnerProfileBio
source: Bio:
ar: وصف تعريفي:

# taskReviewHOMainTitle
source: Task Review
ar: تقييم المهمة

# taskReviewHOReviewTask
source: Review Task Provider
ar: تقييم مُقدم الخدمة

# taskReviewHORating
source: Rating :
ar: التقييم :

# taskReviewHOReview
source: Review:
ar: أضف تعليقاً:

# taskReviewHOAddReview
source: Add a review
ar: اكتب تعليقك هنا ..
