Repository: Khalid-J02/Software_Project
Catalog: lib/l10n/app_*.arb
Languages: ar

# welcomePageLogin
source: Login
ar: تسجيل الدخول

# welcomePageRegister
source: Register
ar: تسجيل

# loginEmailAddress
source: Email Address
ar: البريد الإلكتروني

# loginEmailAddressHintText
source: Enter your email here ...
ar: أدخل البريد الإلكتروني هنا ..

# loginPassword
source: Password
ar: كلمة السر

# loginPasswordHintText
source: Enter your password here ...
ar: أدخل كلمة السر هنا ..

# loginLoginButton
source: Login
ar: تسجيل الدخول

# loginNoAccountText
source: Don't have an account yet?,
ar: لا يوجد لك حساب ؟

# loginRegisterLabel
source: Register
ar: سجل الآن

# loginForgetPassText
source: Forget Your Password?,
ar: نسيت كلمة السر؟

# loginResetPassword
source: Reset Password
ar: أعد ضبط كلمة السر

# registerFirstName
source: First Name
ar: الاسم الأول

# registerFirstNameHintText
source: Enter your first name here
ar: أدخل اسمك الأول هنا

# registerLastName
source: Last Name
ar: اسم العائلة

# registerLastNameHintText
source: Enter your last name here
ar: أدخل اسم العائلة هنا

# registerUserTypeDefault
source: Your Role
ar: دورك

# registerUserTypeHomeOwner
source: Home Owner
ar: مالك منزل

# registerUserTypeServiceProvider
source: Service Provider
ar: مقدم خدمات

# registerEmailAddress
source: Email Address
ar: البريد الإلكتروني

# registerEmailAddressHintText
source: Enter your email here ...
ar: أدخل البريد الإلكتروني هنا ..

# registerPassword
source: Password
ar: كلمة السر

# registerPasswordHintText
source: Enter your password here ...
ar: أدخل كلمة السر هنا ..

# registerPasswordConfirm
source: Confirm Password
ar: تأكيد كلمة السر

# registerPasswordConfirmHintText
source: confirm your password ...
ar: أعد كتابة كلمة السر هنا ..

# registerContinue
source: Continue
ar: إستمر

# registerAlreadyHaveAccount
source: Already have an account?
ar: هل لديك حساب ؟

# registerLoginLabel
source: Login
ar: تسجيل الدخول

# continueRegisterHOPickProfile
source: Pick Profile Picture
ar: اختر صورتك الشخصية

# continueRegisterHOPhoneNumber
source: Phone Number
ar: رقم الهاتف

# continueRegisterHOPhoneNumberHintText
source: Enter your Phone Number here
ar: أدخل رقم الهاتف هنا ..

# continueRegisterHOUserLocation
source: Your City
ar: اختر مدينتك

# continueRegisterHOUserLocationNablus
source: Nablus
ar: نابلس

# continueRegisterHOUserLocationRamallah
source: Ramallah
ar: رام الله

# continueRegisterHOUserLocationTulkarm
source: Tulkarm
ar: طولكرم

# continueRegisterHOUserLocationQalqilya
source: Qalqilya
ar: قلقيلية

# continueRegisterHOUserLocationJenin
source: Jenin
ar: جنين

# continueRegisterHOUserLocationJericho
source: Jericho
ar: أريحا

# continueRegisterHOBio
source: Your Bio
ar: عرف عن نفسك

# continueRegisterHOBioHintText
source: Enter your bio here
ar: أضف شرح بسيط عن نفسك ..

# continueRegisterHOBack
source: Back
ar: عودة

# continueRegisterHOFinish
source: Finish
ar: تسجيل

# continueRegisterSPPickProfile
source: Pick Profile Picture
ar: اختر صورتك الشخصية

# continueRegisterSPPhoneNumber
source: Phone Number
ar: رقم الهاتف

# continueRegisterSPPhoneNumberHintText
source: Enter your Phone Number here
ar: أدخل رقم الهاتف هنا ..

# continueRegisterSPUserLocation
source: Your City
ar: اختر مدينتك

# continueRegisterSPUserLocationNablus
source: Nablus
ar: نابلس

# continueRegisterSPUserLocationRamallah
source: Ramallah
ar: رام الله

# continueRegisterSPUserLocationTulkarm
source: Tulkarm
ar: طولكرم

# continueRegisterSPUserLocationQalqilya
source: Qalqilya
ar: قلقيلية

# continueRegisterSPUserLocationJenin
source: Jenin
ar: جنين

# continueRegisterSPUserLocationJericho
source: Jericho
ar: أريحا

# continueRegisterSPServiceType
source: Service Type
ar: اختر نوع الخدمة التي تقدمها

# continueRegisterSPServiceTypeSurveyor
source: Surveyor
ar: مسّاح

# continueRegisterSPServiceTypeEngineeringOffice
source: Engineering Office
ar: مكتب هندسي

# continueRegisterSPServiceTypeConstructor
source: Constructor
ar: عامل بناء

# continueRegisterSPServiceTypePlumbing
source: Plumbing Technician
ar: فني سباكة

# continueRegisterSPServiceTypeElectrical
source: Electrical Technician
ar: فني كهرباء

# continueRegisterSPServiceTypeInsulation
source: Insulation Technician
ar: فني عزل

# continueRegisterSPServiceTypePlasterer
source: Plasterer
ar: قصير

# continueRegisterSPServiceTypeCarpenter
source: Carpenter
ar: نجار

# continueRegisterSPServiceTypeTile
source: Tile Contractor
ar: فني بلاط

# continueRegisterSPServiceTypePainter
source: Painter
ar: فني دهان

# continueRegisterSPServiceTypeWindow
source: Window Installer
ar: فني تركيب نوافذ

# continueRegisterSPBio
source: Your Bio
ar: عرف عن نفسك

# continueRegisterSPBioHintText
source: Enter your bio here
ar: أضف شرح بسيط عن نفسك ..

# continueRegisterSPBack
source: Back
ar: عودة

# continueRegisterSPFinish
source: Finish
ar: تسجيل

# forgetPasswordMainTitle
source: Find Your BuildNex Account
ar: ابحث عن حسابك الان

# forgetPasswordDescriptionMainTitle
source: Enter the email associated with your account to change your password
ar: أدخل البريد الإلكتروني المرتبط بحسابك لتغيير كلمة المرور الخاصة بك

# forgetPasswordEmailAddress
source: Email Address
ar: البريد الإلكتروني

# forgetPasswordEmailAddressHintText
source: Enter your email here ...
ar: أدخل البريد الإلكتروني الخاص بك هنا ..

# forgetPasswordResetAddress
source: Reset Password
ar: إعادة ضبط كلمة السر

# forgetPasswordCodeMainTitle
source: We sent you a code
ar: لقد قمنا ببعث رمز

# forgetPasswordCodeDescriptionMainTitle
source: check your email to get your verification code. If you need to request a new code, go back and re-enter your email.
ar: تحقق من بريدك الإلكتروني للحصول على رمز التحقق الخاص بك. إذا كنت بحاجة إلى طلب رمز جديد ، فارجع وأعد إدخال بريدك الإلكتروني.

# forgetPasswordCodeVerificationCode
source: Verification Code
ar: رمز التحقق

# forgetPasswordCodeVerificationCodeHintText
source: Enter your code ..
ar: قم بإدخال رمز التحقق هنا ..

# forgetPasswordCodeBack
source: Back
ar: عودة

# forgetPasswordCodeNext
source: Next
ar: تسجيل

# resetPasswordMainTitle
source: Resetting Your account Password
ar: إعادة تعيين كلمة مرور حسابك

# resetPasswordPassword
source: Password
ar: كلمة السر

# resetPasswordPasswordHintText
source: Enter your password here ...
ar: قم بإدخال كلمة السر هنا ..

# resetPasswordConfirmPassword
source: Confirm Password
ar: تأكيد كلمة المرور

# resetPasswordConfirmPasswordHintText
source: Confirm your password ...
ar: قم بإدخال كلمة السر مرة أخرى هنا ..

# resetPasswordResetLabel
source: Reset Password
ar: أعد ضبط كلمة السر

# homeNavHomeOwnerHomeIcon
source: Home
ar: الصفحة الرئيسية

# homeNavHomeOwnerSearchIcon
source: Search
ar: بحث

# homeNavHomeOwnerProfileIcon
source: Profile
ar: الصفحة الشخصية

# homeOwnerHomePageAppBarTitle
source: Your Constructions
ar: مشاريعك الخاصة

# homeOwnerProjectNavAppBarTitle
source: Back
ar: رجوع

# homeOwnerProjectNavTasksIcon
source: Tasks
ar: المهام

# homeOwnerProjectNavDescriptionIcon
source: Description
ar: تفاصيل المشروع

# homeOwnerProjectTasksMaterialProv
source: Material Prov..
ar: مزودي الخدمات

# homeOwnerProjectTasksOpenTask
source: Open Task
ar: فتح المهمة

# homeOwnerProjectTasksAddProvider
source: Add Service Provider
ar: تعيين مقدم الخدمة

# homeOwnerProjectDataOwnedBy
source: Owned By :
ar: مالك المشروع :

# homeOwnerProjectDataStatus
source: Status :
ar: حالة المشروع :

# homeOwnerProjectDataCity
source: City
ar: المدينة

# homeOwnerProjectDataAddress
source: Address
ar: العنوان

# homeOwnerProjectDataBasinNumber
source: Basin Number
ar: رقم الحوض

# homeOwnerProjectDataPlotNumber
source: Plot Number
ar: رقم القطعة

# homeOwnerProjectDataAccordionMainTitle
source: Main Project Information
ar: معلومات عامة عن المشروع

# homeOwnerProjectDataAccordionBuildingArea
source: Building Area
ar: مساحة البناء

# homeOwnerProjectDataAccordionNumbersOfRooms
source: Numbers of Rooms
ar: عدد الغرف

# homeOwnerProjectDataAccordionNumbersOfFloors
source: Numbers of Floors
ar: عدد الطوابق

# homeOwnerProjectDataAccordionDesignDrawings
source: Design Drawings
ar: مخطط التصميم

# homeOwnerProjectDataAccordionOpenDocument
source: Open Document
ar: فتح الملف

# homeNavServiceProviderTasksIcon
source: Tasks
ar: المهام

# homeNavServiceProviderRequestsIcon
source: Requests
ar: الطلبات

# homeNavServiceProviderCatalogIcon
source: Catalog
ar: الكتالوج

# homeNavServiceProviderWorkExpIcon
source: Work Exp.
ar: الخبرة

# homeNavServiceProviderProfileIcon
source: Profile
ar: الصفحة الشخصية

# homeNavServiceProviderTasksKey
source: Welcome to the Tasks tab! Here, you can effectively manage and track all the tasks you are currently working on. This tab provides a comprehensive view of your ongoing projects, allowing you to organize your workload and stay on top of your commitments.
ar: مرحبًا بك في علامة التبويب 'المهام' ! هنا، يمكنك إدارة وتتبع جميع المهام التي تعمل عليها حاليًا بشكل فعال. توفر علامة التبويب هذه عرضًا شاملاً لمهامك الحالية، مما يسمح لك بتنظيم عبء العمل الخاص بك والبقاء على اطلاع بالتزاماتك.

# homeNavServiceProviderRequestsKey
source: This is the Requests tab. In this section, you'll receive job requests from homeowners. You have the flexibility to accept tasks that align with your schedule and expertise or decline them as needed. It's your one-stop hub for managing incoming work inquiries and planning your workload.
ar: هذه هي علامة تبويب 'الطلبات'. في هذا القسم، ستتلقى طلبات عمل من أصحاب المنازل. لديك المرونة اللازمة لقبول المهام التي تتوافق مع جدولك الزمني وخبرتك أو رفضها حسب الحاجة.

# homeNavServiceProviderCatalogKey
source: Explore the Catalog tab! As a service provider, this is your space to showcase the services you offer. If you're a painter, for example, you can display various color options and related services here. It's a great way to let potential clients know what you have to offer and attract more business.
ar: استكشف علامة التبويب 'الكتالوج'! حيث أنك كمقدم خدمة، هذه هي المساحة الخاصة بك لعرض الخدمات التي تقدمها. إذا كنت فنّي دهان، على سبيل المثال، يمكنك عرض خيارات الألوان المتنوعة والخدمات ذات الصلة هنا. إنها طريقة رائعة للسماح للعملاء المحتملين بمعرفة ما لديك لتقدمه وجذب المزيد من الأعمال.

# homeNavServiceProviderWorkExpKey
source: Discover the Work Experience tab. Here, you can display your past projects and highlight your achievements. It's an excellent opportunity to showcase your skills and experience, giving potential clients a glimpse of your expertise and the quality of work you deliver.
ar: هذه هي علامة تبويب 'خبرة العمل'. هنا، يمكنك عرض مشاريعك السابقة وتسليط الضوء على إنجازاتك. إنها فرصة ممتازة لعرض مهاراتك وخبراتك، مما يمنح العملاء المحتملين لمحة عن خبرتك وجودة العمل الذي تقدمه.

# homeNavServiceProviderProfileKey
source: Welcome to the Profile Page! Here, you can easily view and update your personal details and preferences. This is your hub for ensuring your profile information is accurate and up-to-date, making it easier for service providers and other users to connect with you.
ar: مرحبًا بك في صفحة الملف الشخصي! هنا، يمكنك بسهولة عرض وتحديث بياناتك وتفضيلاتك الشخصية.

# coachmarkNext
source: Next
ar: التالي

# coachmarkSkip
source: Skip
ar: تخطي

# serviceProviderRequestsMainTitle
source: Requests
ar: طلبات المهام

# serviceProviderRequestPageKey
source: This is the Requests Page. In this section, you'll receive job requests from homeowners. You have the flexibility to accept tasks that align with your schedule and expertise or decline them as needed. It's your one-stop hub for managing incoming work inquiries and planning your workload.
ar: هذه هي صفحة الطلبات. في هذا القسم، ستتلقى طلبات عمل من أصحاب المنازل. لديك المرونة اللازمة لقبول المهام التي تتوافق مع جدولك الزمني وخبرتك أو رفضها حسب الحاجة. إنها مركزك لإدارة الطلبات.

# serviceProviderCatalogMainTitle
source: Catalog
ar: الكتالوج

# serviceProviderCatalogPageKey
source: Tap the '+' button to include new items in your catalog. This feature allows you to expand your service range by adding new items or services you provide. Whether it's a new paint color, a special tool, or a unique service, use this space to keep your catalog up-to-date and appealing to your clients.
ar: اضغط على الزر '+' لإضافة عناصر جديدة في الكتالوج الخاص بك. تتيح لك هذه الميزة توسيع نطاق الخدمة الخاص بك عن طريق إضافة عناصر أو خدمات جديدة تقدمها. على سبيل المثال إذا كنت فنَي دهان يمكنك إضافة لون طلاء جديد، ونوعه، أو أي خدمة فريدة تقدمها لجذب العملاء.

# serviceProviderCatalogText
source: There is no catalog items to see here...
ar: لا توجد عناصر في الكتالوج لرؤيتها هنا...

# serviceProviderAssetsMainTitle
source: My Work Experience
ar: الخبرة العملية

# serviceProviderAssetsPageKey
source: Click here to include details about your previous projects, such as the project name, a brief description, and an image that showcases your skills. This helps potential clients understand the quality and scope of your work, building trust and credibility in your services.
ar: انقر هنا لإضافة تفاصيل حول مشاريعك السابقة، مثل اسم المشروع ووصفًا مختصرًا وصورة تعرض مهاراتك. وهذا يساعد العملاء المحتملين على فهم جودة عملك ونطاقه، وبناء الثقة والمصداقية في خدماتك.

# serviceProviderAssetsText
source: There is no work experiences to see here...
ar: لا توجد خبرات عمل يمكن رؤيتها هنا...

# serviceProviderProfileInfoKey
source: Edit your profile information here. Tap this icon to update your personal details such as your phone number, email, and a short bio. Keeping your profile updated ensures better communication and personalization.
ar: عدَل معلومات ملفك الشخصي هنا. انقر على هذا الأيقونة لتحديث التفاصيل الشخصية مثل رقم الهاتف، البريد الإلكتروني ونبذة قصيرة عنك. الحفاظ على تحديث ملفك الشخصي يضمن تواصلًا أفضل.

# serviceProviderProfileImageKey
source: Personalize your profile by updating your profile picture. Tap here to choose and upload a new image. This picture represents you in the app and helps others recognize you easily.
ar: خصص ملفك الشخصي عن طريق تحديث صورتك. انقر هنا لاختيار وتحميل صورة جديدة. تمثل هذه الصورة هويتك في التطبيق وتساعد الآخرين على التعرف عليك بسهولة.

# serviceProviderProfileReviewKey
source: Dive into the 'Reviews' section to read the feedback from homeowners who have utilized your services. Tapping here will display their comments and ratings. Homeowner feedback is a great way to gauge your service quality and establish a trusted reputation for prospective homeowners.
ar: اطلع على قسم 'المراجعات' لقراءة تعليقات المنزلين الذين استفادوا من خدماتك. النقر هنا سيعرض تعليقاتهم وتقييماتهم. المراجعات من أصحاب المنازل طريقة رائعة لقياس جودة خدمتك وبناء سمعة موثوقة لدى العملاء المحتملين.

# serviceProviderProfileReviewsTitle
source: Your Reviews
ar: مراجعاتك

# serviceProviderProfileReviewsText
source: No reviews yet...
ar: لا توجد مراجعات بعد...

# serviceProviderProfileReviewsClose
source: Close
ar: إغلاق

# serviceProviderDataRole
source: Service Provider
ar: مقدم خدمة

# serviceProviderDataPhoneNumber
source: Phone Number
ar: رقم الجوال

# serviceProviderDataEmail
source: E-Mail
ar: البريد الإلكتروني

# serviceProviderDataPriceHour
source: Price / Hour
ar: السعر / ساعة

# serviceProviderDataPrice
source: JOD
ar: دينار

# serviceProviderDataBio
source: Bio
ar: النبذة التعريفية

# reviewTabShowMore
source: show more
ar: عرض المزيد

# reviewTabShowLess
source: show less
ar: عرض أقل

# serviceProviderProfileDialogEditPersonalInfoTitle
source: Edit Personal Info
ar: تعديل المعلومات الشخصية

# serviceProviderProfileDialogPhoneNumberHint
source: Enter Your new Number
ar: أدخل رقمك الجديد

# serviceProviderProfileDialogPhoneNumberLabel
source: Phone Number
ar: رقم الجوال

# serviceProviderProfileDialogEmailHint
source: Enter Your new E-Mail
ar: أدخل بريدك الإلكتروني الجديد

# serviceProviderProfileDialogEmailLabel
source: E-Mail
ar: البريد الإلكتروني

# serviceProviderProfileDialogPricePerHourHint
source: Enter Your new price
ar: أدخل سعرك الجديد

# serviceProviderProfileDialogPricePerHourLabel
source: Price / Hour
ar: السعر / الساعة

# serviceProviderProfileDialogBioHint
source: Enter Your new bio
ar: أدخل نبذتك التعريفية الجديدة

# serviceProviderProfileDialogBioLabel
source: Your Bio
ar: النبذة التعريفية

# serviceProviderProfileDialogSaveButton
source: Save
ar: حفظ

# serviceProviderProfileDialogCancelButton
source: Cancel
ar: إلغاء

# addAssetNewItemMainTitle
source: Add New Work Experience
ar: إضافة خبرة عمل جديدة

# addAssetNewItemItemNameHint
source: Enter Work Exp. Name
ar: أدخل عنوان الخبرة العملية

# addAssetNewItemItemNameLabel
source: Work Exp. Name
ar: عنوان الخبرة العملية

# addAssetNewItemItemDesHint
source: Enter Work Exp. Description
ar: أدخل وصف الخبرة العملية

# addAssetNewItemItemDesLabel
source: Work Exp. Description
ar: وصف الخبرة العملية

# addAssetNewItemItemImageText
source: Work Exp. Image :
ar: صورة من الخبرة العملية :

# addAssetNewItemAddButton
source: Add
ar: إضافة

# addAssetNewItemCancelButton
source: Cancel
ar: إلغاء

# serviceProviderAssetsItemDetailsTitle
source: Back
ar: رجوع

# sp_AssetItemDialogTitle
source: Edit Item Info
ar: تعديل معلومات الخبرة العملية

# sp_AssetItemDialogNewNameHint
source: Enter Item New Name
ar: أدخل عنوان الخبرة العملية الجديد

# sp_AssetItemDialogNewNameLabel
source: Item Name
ar: عنوان الخبرة العملية

# sp_AssetItemDialogNewDescHint
source: Item New Description
ar: أدخل وصف الخبرة العملية الجديد

# sp_AssetItemDialogNewDescLabel
source: Item Description
ar: وصف الخبرة العملية

# serviceProviderCatalogItemDetailsColor
source: Color :
ar: اللون :

# sp_CatalogItemTitle
source: Edit Item Info
ar: تعديل معلومات العنصر المتوفر

# sp_CatalogItemNewNameHint
source: Enter Item New Name
ar: أدخل اسم العنصر الجديد

# sp_CatalogItemNewNameLabel
source: Item Name
ar: اسم العنصر

# sp_CatalogItemNewPriceHint
source: Enter Item New Price
ar: أدخل سعر العنصر الجديد

# sp_CatalogItemNewPriceLabel
source: Item Price
ar: سعر العنصر

# sp_CatalogItemNewDescHint
source: Item New Description
ar: أدخل وصف العنصر الجديد

# sp_CatalogItemNewDescLabel
source: Item Description
ar: وصف العنصر

# addCatalogNewItemMainTitle
source: Add New Catalog Item
ar: إضافة عنصر جديد للكتالوج

# addCatalogNewItemItemNameHint
source: Enter Item Name
ar: أدخل اسم العنصر

# addCatalogNewItemItemNameLabel
source: Item Name
ar: اسم العنصر

# addCatalogNewItemItemDesHint
source: Enter Item Description
ar: أدخل وصف العنصر

# addCatalogNewItemItemDesLabel
source: Item Description
ar: وصف العنصر

# addCatalogNewItemItemPriceHint
source: Enter Item Price
ar: أدخل سعر العنصر

# addCatalogNewItemItemPriceLabel
source: Item Price
ar: سعر العنصر

# addCatalogNewItemColor
source: Color :
ar: اللون :

# addCatalogNewItemItemImageText
source: Item Image :
ar: صورة العنصر :

# addCatalogNewItemAddButton
source: Add
ar: إضافة

# addCatalogNewItemCancelButton
source: Cancel
ar: إلغاء

# customError
source: Error
ar: خطأ

# customOk
source: OK
ar: حسنًا

# customFill
source: Please fill in all required fields.
ar: يرجى تعبئة جميع الحقول المطلوبة.

# customInvalidPrice
source: Invalid item price.
ar: سعر العنصر غير صالح.

# sp_RequestDetails_ButtonText
source: See Details
ar: عرض التفاصيل

# customDeclineTitle
source: Decline Request
ar: رفض الطلب

# customDeclineReason
source: Please provide a reason for declining the request:
ar: يرجى تقديم سبب لرفض الطلب:

# customDeclineReasonLabel
source: Please enter a reason
ar: الرجاء إدخال سبب

# customDeclineReasonHint
source: Enter reason...
ar: أدخل السبب...

# customDeclineReasonCancel
source: Cancel
ar: إلغاء

# customDeclineReasonSubmit
source: Submit
ar: إرسال

# customAcceptTitle
source: Confirm
ar: تأكيد

# customAcceptText
source: Do you want to accept this request?
ar: هل تريد تأكيد قبول هذا الطلب؟

# customAcceptYes
source: Yes
ar: نعم

# customAcceptNo
source: Not Yet
ar: ليس بعد

# projectDetails_SP_Des
source: Construction Desc
ar: معلومات البناء

# projectDetails_SP_HO
source: Homeowner Profile
ar: معلومات مالك المنزل

# projectDataDetailsOwned
source: Owned By
ar: مِلك لـ

# projectDataDetailsAddress
source: Address
ar: عنون البناء

# projectDataDetailsTaskName
source: Task Name
ar: عنوان المهمة

# projectDataDetailsTaskDesc
source: Task Description
ar: وصف المهمة

# projectDataDetailsTaskDate
source: Expected Date For Task
ar: التاريخ المتوقع للبدء بالمهمة

# homeownerRole
source: Homeowner
ar: مالك منزل

# serviceProviderTasksHomeText
source: Home
ar: الصفحة الرئيسية

# customLogoutConfirmation
source: Logout Confirmation
ar: تأكيد تسجيل الخروج

# customLogoutContent
source: Are you sure you want to logout?
ar: هل أنت متأكد أنك تريد تسجيل الخروج؟

# customCancel
source: Cancel
ar: إلغاء

# customLogout
source: Logout
ar: تسجيل الخروج

# listChatScreenTitle
source: Chat
ar: الدردشة

# userItemLastActive
source: Last Active :
ar: آخر ظهور : منذ

# chatScreenLastOnline
source: Online
ar: نشط الآن

# chatScreenLastOffline
source: Offline
ar: غير نشط

# chatTextFieldMessageLabel
source: Message
ar: رسالة

# chatTextFieldMessageHint
source: Add Message...
ar: أضف رسالة...

# chatTextFieldMessageDialog
source: Please enter a message before sending.
ar: الرجاء إدخال الرسالة قبل الإرسال.

# homepageNotificationsTitle
source: Notifications
ar: الإشعارات

# homepageNotificationsMark
source: Mark all read
ar: تحديد الكل كمقروء

# homepageNotificationShowSnackBar
source: All notifications marked as read
ar: تم تحديد جميع الإشعارات كمقروءة

# homepageNotificationShowSnackBarError
source: Failed to mark notifications as read
ar: هناك خطأ في تحديد الإشعارات كمقروءة

# sp_TaskDetails_OpenTask
source: Open Task
ar: تفاصيل المهمة

# taskStatusNotStarted
source: Not Started
ar: لم تبدأ

# taskStatusInProgress
source: In Progress
ar: قيد التنفيذ

# taskStatusCompleted
source: Completed
ar: مكتملة

# customStaticTaskTitle
source: Static Task
ar: مهمة ثابتة

# customSuccess
source: Success
ar: نجاح

# customParallelTasksTitle
source: Parallel Tasks Available
ar: هناك مهام متوازية متاحة

# customParallelTasksContent
source: You can perform tasks related to Mechanical, Electrical, and Insulation in parallel to save time, with the Insulation being an optional Task
ar: يمكنك أداء المهام المتعلقة بالميكانيكا والكهرباء والعزل بشكل متوازي لتوفير الوقت، مع كون عملية العزل اختيارية

# customExpectedDateTitle
source: Expected Date
ar: التاريخ المتوقع

# customExpectedDateContent
source: Please provide an expected date for the task:
ar: يرجى تحديد تاريخ متوقع للمهمة:

# customExpectedDateError
source: Please enter a date
ar: يرجى إدخال التاريخ

# customExpectedDateHint
source: Enter Date...
ar: أدخل التاريخ...

# customSubmit
source: Submit
ar: إرسال

# sp_taskTitle
source: Task Details
ar: تفاصيل المهمة

# sp_task1Name
source: Property Survey
ar: مسح الممتلكات

# taskInformationTaskLabel
source: Task
ar: المهمة

# taskInformationStatus
source: Status
ar: حالة المهمة

# landInformationTitle
source: Land Information
ar: معلومات الأرض

# landInformationBasin
source: Basin Number
ar: رقم الحوض

# landInformationPlot
source: Plot Number
ar: رقم قطعة الأرض

# taskProviderInformationTitle
source: Task Provider
ar: مقدم الخدمة

# taskProviderInformationName
source: Me
ar: أنـا

# taskProviderInformationReviews
source: reviews
ar: مراجعات

source: Land Area
ar: مساحة الأرض

source: Enter Land Area Here
ar: أدخل مساحة الأرض هنا

source: Survey Document:
ar: مخطط المساحة:

source: Upload
ar: تحميل

source: Open
ar: فتح

source: Download
ar: تنزيل

source: Your Notes:
ar: ملاحظاتك:

# enterNotesHere
source: Enter Notes here if any
ar: أدخل الملاحظات هنا إن وجدت

source: Save
ar: حفظ

source: Mark as Done
ar: قمت بإنهاء المهمة

source: Complete Task
ar: اكمال المهمة

# clickOkToComplete
source: By clicking OK, you will mark the task as complete.
ar: بالنقر على موافق، ستعتبر المهمة كمكتملة.

# clickOk
source: OK
ar: موافق

# snackbarHi
source: Hi
ar: مرحبا

# snackbarContent
source: There is no file to open
ar: لا يوجد هناك ملف لفتحه

# sp_task2Name
source: Regulatory Information
ar: المعلومات التنظيمية

# sp_task2Document
source: Regulatory Document:
ar: مستند المعلومات التنظيمية:
